python_basic.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-02-15 Thu 01:00 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Python - Basic</title>
<meta name="author" content="shaka" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Python - Basic</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgdfb54b5">Python解释器</a>
<ul>
<li><a href="#org5cd25e3">CPython</a></li>
<li><a href="#orgfc4e04f">PyPy</a></li>
<li><a href="#org164797c">Jython</a></li>
<li><a href="#orgad0331f">IPython</a></li>
</ul>
</li>
<li><a href="#orgb0c794c">Python语法</a>
<ul>
<li><a href="#orgc7f6ab0">基础</a></li>
<li><a href="#orgac1e2b7">输入输出</a></li>
<li><a href="#orgc81bcc5">控制流</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgdfb54b5" class="outline-2">
<h2 id="orgdfb54b5">Python解释器</h2>
<div class="outline-text-2" id="text-orgdfb54b5">
<p>
Python程序运行时，需要Python解释器去执行 <code>.py</code> 文件。下面是一些常见的Python解释器。
</p>
</div>
<div id="outline-container-org5cd25e3" class="outline-3">
<h3 id="org5cd25e3">CPython</h3>
<div class="outline-text-3" id="text-org5cd25e3">
<p>
当Python安装好之后，CPython解释器就已经安装好了。该解释器是用C语言开发的，所以被称为CPython。在终端执行 <code>python</code> 命令后启动的就是该解释器。
</p>
</div>
</div>
<div id="outline-container-orgfc4e04f" class="outline-3">
<h3 id="orgfc4e04f">PyPy</h3>
<div class="outline-text-3" id="text-orgfc4e04f">
<p>
PyPy解释器采用JIT技术对Python程序代码进行动态编译，所以PyPy以执行速度见长。
</p>
</div>
</div>
<div id="outline-container-org164797c" class="outline-3">
<h3 id="org164797c">Jython</h3>
<div class="outline-text-3" id="text-org164797c">
<p>
Jython解释器可以将Python程序代码转换为Java字节码，在Java平台上运行。
</p>
</div>
</div>
<div id="outline-container-orgad0331f" class="outline-3">
<h3 id="orgad0331f">IPython</h3>
<div class="outline-text-3" id="text-orgad0331f">
<p>
IPython是基于CPython之上的一个交互式（interactive）Python解释器，所以被称为IPython。
</p>
<ul class="org-ul">
<li>没有内建到Python自身中的IPython特殊命令称为魔术命令，可以看作是IPython系统内部的命令行程序。魔术命令的前缀符号是百分号 <code>%</code> 。使用魔术命令也可以不加百分号，只要没有变量被定义与魔术函数名字相同即可。这种特性称为自动魔术，通过 <code>%automagic</code> 进行启动禁用。</li>
</ul>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">命令</th>
<th scope="col" class="org-left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>%quickref</code></td>
<td class="org-left">显示IPython快速参考卡。</td>
</tr>

<tr>
<td class="org-left"><code>%magic</code></td>
<td class="org-left">显示所有可用魔术命令的详细文档。</td>
</tr>

<tr>
<td class="org-left"><code>%debug</code></td>
<td class="org-left">从最后发生报错的底部进入交互式调试器。</td>
</tr>

<tr>
<td class="org-left"><code>%hist</code></td>
<td class="org-left">打印历史命令输入。</td>
</tr>

<tr>
<td class="org-left"><code>%pdb</code></td>
<td class="org-left">出现任意报错后自动进入调试器。</td>
</tr>

<tr>
<td class="org-left"><code>%paste</code></td>
<td class="org-left">从剪贴板中执行已经预先格式化的Python代码。</td>
</tr>

<tr>
<td class="org-left"><code>%cpaste</code></td>
<td class="org-left">打开一个特殊提示符，手动粘贴待执行的Python代码。</td>
</tr>

<tr>
<td class="org-left"><code>%reset</code></td>
<td class="org-left">删除交互式命名空间中所有的变量、名称。</td>
</tr>

<tr>
<td class="org-left"><code>%page OBJECT</code></td>
<td class="org-left">通过分页器更美观地打印显示一个对象。</td>
</tr>

<tr>
<td class="org-left"><code>%run SCRIPT.py</code></td>
<td class="org-left">在IPython中运行一个Python脚本。</td>
</tr>

<tr>
<td class="org-left"><code>%prun STATEMENT</code></td>
<td class="org-left">使用 <code>CProfile</code> 执行语句，并报告输出。</td>
</tr>

<tr>
<td class="org-left"><code>%time STATEMENT</code></td>
<td class="org-left">报告单个语句的执行时间。</td>
</tr>

<tr>
<td class="org-left"><code>%timeit STATEMENT</code></td>
<td class="org-left">多次运行单个语句计算平均执行时间（在估算代码最短执行时间时有用）。</td>
</tr>

<tr>
<td class="org-left"><code>%who</code>, <code>%who_ls</code>, <code>%whos</code></td>
<td class="org-left">根据不同的详细程度，展示交互命名空间中定义的变量。</td>
</tr>

<tr>
<td class="org-left"><code>%xdel VARIABLE</code></td>
<td class="org-left">在IPython内部删除一个变量，清除相关的引用。</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>在IPython会话中，可以使用 <code>%run</code> 命令运行任意的Python文件。IPython会在同一个进程内执行指定文件中的代码，确保在执行完成时可以立即得到结果。如果一个Python脚本需要命令行提供参数（通过 <code>sys.argv</code> 获得），那么则需要在命令行的文件路径后面加上参数进行传递。如果想让运行的脚本使用交互式IPython命名空间中已有的变量，需要使用 <code>%run -i</code> 替代 <code>%run</code> 。</li>
<li><code>%paste</code> 会获得剪贴板中的所有文本，并作为代码块在命令行中执行； <code>%cpaste</code> 与之类似，只不过它会给出一个特殊的提示符提示粘贴代码。</li>
<li><code>%matplotlib</code> 魔术函数可以设置matplotlib与IPython命令行或Jupyter notebook的集成。</li>
<li>在任意代码运行时按下 <code>Ctrl-C</code> ，无论脚本是通过 <code>%run</code> 或是其他长命令运行的，都将引起 <code>KeyboardInterrupt</code> ，导致所有的Python程序立即停止运行（某些特殊情况除外）。</li>
<li>IPython中大多数Python对象会被格式化为更可读、更美观的形式。</li>
<li>IPython还提供执行任意代码块（通过复制粘贴）和整个Python脚步的功能。</li>
<li>在一个变量名的前后使用问号(<code>?</code>)可以显示一些关于该对象的概要信息。使用双问号(<code>??</code>) 可以显示函数的源代码。 <code>?</code> 可以像Unix命令行一样搜索IPython命名空间。把一些字符和通配符(<code>*</code>)结合在一起，会显示所有匹配通配符表达式的命令。</li>
</ul>

<p>
需要启动Jupyter时，可以在终端中运行如下命令。
</p>
<div class="org-src-container">
<pre class="src src-python">jupyter notebook
</pre>
</div>
<p>
在很多平台上，Jupyter会自动默认网络浏览器（除非启动Jupyter时使用了 <code>--no-browser</code> 命令）。
</p>
</div>
</div>
</div>
<div id="outline-container-orgb0c794c" class="outline-2">
<h2 id="orgb0c794c">Python语法</h2>
<div class="outline-text-2" id="text-orgb0c794c">
</div>
<div id="outline-container-orgc7f6ab0" class="outline-3">
<h3 id="orgc7f6ab0">基础</h3>
<div class="outline-text-3" id="text-orgc7f6ab0">
<p>
Python采用缩进（tab或者空格）来组织代码，而不是像其他语言（如C++、R、Java和Perl）那样采用大括号。一个冒号代表一个缩进的开始，单个代码块中所有的代码必须保持相同的缩进，知道代码块结束。Python不需要以分号结尾，但是可以用于分隔一行内的多条语句。
</p>

<p>
Python语言的一个重要特征就是对象模型的一致性。每一个数值、字符串、数据结构、函数、类、模块以及所有存在于Python解释器中的事物，都是Python对象。每个对象都会关联到一种类型（例如字符串、函数）和内部数据。
</p>

<p>
所有写在 <code>#</code> 之后的文本都会被Python解释器自动忽略。因此，通常使用 <code>#</code> 在代码中添加注释。
</p>

<p>
几乎所有的Python对象都有内部函数，称为方法，可以访问到对象内部的内容。
</p>

<p>
在Python中，赋值也称为绑定，因为赋值操作会把一个变量名绑定到一个对象上，被赋值变量名也称为被绑定变量。对一个变量（或者变量名）赋值，本质就是创建一个指向等号右边对象的引用。当把一个对象作为参数传给一个函数时，指向原始对象的新的本地变量就会被创建而无须复制。可以使用关键字 <code>is</code> 和 <code>is not</code> 检查两个引用是否指向同一个对象或不同对象。值得注意的是，函数 <code>list</code> 总是创建一个新的Python列表（即一份拷贝）。
</p>

<p>
与C++、Java等大多数编译型语言不同，Python中的对象引用并不涉及类型。变量对于对象来说只是特定命名空间中的名称，类型信息是存储在对象自身里的。可以使用函数 <code>isinstance</code> 来检查一个对象是否是特定类型的实例，该函数可以接受一个包含类型的元组作为参数，用于检查对象的类型是否在元组中的类型中。如：
</p>
<div class="org-src-container">
<pre class="src src-python">isinstance(a, int)
isinstance(a, (int, float))
</pre>
</div>

<p>
在Python中，模块就是以 <code>.py</code> 为后缀名并包含Python代码的文件。
</p>
</div>
</div>
<div id="outline-container-orgac1e2b7" class="outline-3">
<h3 id="orgac1e2b7">输入输出</h3>
<div class="outline-text-3" id="text-orgac1e2b7">
<ul class="org-ul">
<li>函数 <code>print()</code> 可以接受一个字符串作为参数打印输出；也可以接受以逗号分隔的多个字符串作为参数，打印输出拼接起来的字符串（参数之间的分隔逗号会转化为空格）。</li>
<li>函数 <code>intput()</code> 可以将用户在终端的输入赋给字符串变量。</li>
</ul>
</div>
</div>
<div id="outline-container-orgc81bcc5" class="outline-3">
<h3 id="orgc81bcc5">控制流</h3>
<div class="outline-text-3" id="text-orgc81bcc5">
<ul class="org-ul">
<li>一个 <code>if</code> 语句可以接多个 <code>elif</code> 代码块和一个 <code>else</code> 代码块。如果某个条件为 <code>True</code> ，则后面的 <code>elif</code> 和 <code>else</code> 代码块不会执行。当使用 <code>and</code> 和 <code>or</code> 进行混合条件判断时，条件判断是从左到右执行的，而且在 <code>and</code> 和 <code>or</code> 两侧的条件会有短路现象。</li>
<li><code>for</code> 循环用于遍历一个集合（如列表或元组）或一个迭代器。使用关键字 <code>continue</code> 可以跳出本次循环（跳过其后面的代码）进入下一次循环。关键字 <code>break</code> 可以跳出整个 <code>for</code> 循环。对于多重循环， <code>break</code> 只能跳出最内层的 <code>for</code> 循环，外层的其他 <code>for</code> 循环会继续执行。</li>
<li><code>while</code> 循环会在条件符合时一直执行代码块，知道判断条件为 <code>False</code> 或显式地通过关键字 <code>break</code> 跳出循环。</li>
<li><code>pass</code> 表示不执行任何操作。</li>
<li><code>range</code> 函数返回一个迭代器，该迭代器生成一个等差整数序列。产生的整数包含起始但不包含结尾。</li>
<li>Python的三元表达式可以将一个 <code>if-else</code>  联合起来，在一行代码或一个语句中生成数据。其语法为：</li>
</ul>
<div class="org-src-container">
<pre class="src src-python">value = true-expression if condition else false-expression
</pre>
</div>
<p>
其结果与如下代码块的结果相同：
</p>
<div class="org-src-container">
<pre class="src src-python">if condition:
    value = true-expression
else:
    value = false-expression
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
